import { createI18n } from 'vue-i18n'

const messages = {
	ru: {
		services: 'услуги',
		aboutUs: 'о нас',
		contactUs: 'контакты',

		copyright: 'Все права защищены',

		hero_headline1: 'Юридическая поддержка',
		hero_headline2: 'для жизни без стресса в Польше',
		hero_moto: 'Профессиональное сопровождение вашего пути к уверенности и легальности',

		email_placeholder: 'Введите свой email, чтобы начать',
		submitText: 'Начать',

		three_blocks_heading: 'Сталкиваетесь с такими проблемами?',
		three_blocks_1: 'Юридические трудности за границей?',
		three_blocks_1_: 'Не знаете, как подать иск, развестись или оформить алименты в Польше? Мы всё сделаем за вас — грамотно и вовремя.',
		three_blocks_2: 'Языковой барьер и непонимание?',
		three_blocks_2_: 'Переведём документы и переговоры с ZUS, MOPS, судебными органами и другими учреждениями. Вы не одиноки.',
		three_blocks_3: 'Трудности с легализацией пребывания?',
		three_blocks_3_: 'Поможем с оформлением pobyt czasowy или pobyt stały. С нами — меньше стресса, больше шансов на успех.',
	},
	uk: {
		services: 'послуги',
		aboutUs: 'про нас',
		contactUs: 'контакти',

		copyright: 'Усі права захищено',

		hero_headline1: 'Юридичний супровід',
		hero_headline2: 'для життя без стресу в Польщі',
		hero_moto: 'Професійний супровід вашого шляху до впевненості та легальності',

		email_placeholder: 'Введіть свій email, щоб почати',
		submitText: 'Почати',

		three_blocks_heading: 'Чи стикаєтесь Ви з цими проблемами?',
		three_blocks_1: 'Юридичні труднощі за кордоном?',
		three_blocks_1_: 'Не знаєте, як подати позов, розлучитися чи оформити аліменти в Польщі? Ми беремо на себе всю паперову роботу та супровід.',
		three_blocks_2: 'Мовний бар’єр і непорозуміння?',
		three_blocks_2_: 'Перекладемо документи та переговори з органами: ZUS, MOPS, коморник, суд, уряд. Ви більше не самі.',
		three_blocks_3: 'Проблеми з легалізацією?',
		three_blocks_3_: 'Оформлення pobyt czasowy чи pobyt stały — це складно, але з нами це реально. Допоможемо уникнути відмов і затримок.',
	},
}

export default createI18n({
	locale: sessionStorage.getItem('lang') || 'ru',
	fallbackLocale: 'ru',
	messages,
})